app/views/orders/_form.html.erb

    Sklep:
    <%= f.collection_select :shop_id, Shop.all, :id, :nazwa, include_blank: false, include_hidden: false %>
---
SELECT "shops".* FROM "shops" ORDER BY "shops"."nazwa" ASC

              <div class="itemsPromo rowGrid">
                <%= number_field_tag "selected_waffles[#{a.id}][]", 0, min: 0, max: 99, value: OrderWaffle.where(order_id: @order.id, waffle_id: a.id).pluck(:quantity).first || 0 %>
---
SELECT "order_waffles"."quantity" FROM "order_waffles" WHERE "order_waffles"."order_id" = $1 AND "order_waffles"."waffle_id" = $2  [["order_id", 16], ["waffle_id", 980191003]]