app/views/orders/index.html.erb

        <td><%= order.date %></td>
          <td><%= Shop.find(order.shop_id).nazwa %></td>
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]