app/views/orders/show.html.erb

    <strong>Sklep:</strong>
    <%= Shop.find(@order.shop_id).nazwa %>
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

        <tr>
            <td><%= OrderWaffle.where(order_id: @order.id, waffle_id: w.id).pluck(:quantity).first %></td>
---
SELECT "order_waffles"."quantity" FROM "order_waffles" WHERE "order_waffles"."order_id" = $1 AND "order_waffles"."waffle_id" = $2  [["order_id", 13], ["waffle_id", 980191003]]