app/controllers/orders_controller.rb

SELECT "order_waffles"."waffle_id" FROM "order_waffles" WHERE "order_waffles"."order_id" = $1  [["order_id", nil]]
SELECT  1 AS one FROM "waffles" WHERE (id IN ()) LIMIT $1  [["LIMIT", 1]]
SELECT "order_waffles".* FROM "order_waffles" WHERE "order_waffles"."order_id" = $1 AND "order_waffles"."waffle_id" = $2  [["order_id", 13], ["waffle_id", 980191003]]
SELECT "waffles".* FROM "waffles" WHERE (id IN (#<OrderWaffle::ActiveRecord_Relation:0x007f2dec1eef58>))
---
  def show
    order_waffle = OrderWaffle.where("order_id = #{@order.id}").pluck("waffle_id").join(',')
    if !order_waffle.blank?

SELECT "waffles".* FROM "waffles" WHERE ("waffles"."discount" != $1)  [["discount", true]]
---
  def new
    @order = Order.new
    # @waffles = Waffle.all? { |  }
    @waffles = Waffle.where.not(discount:true).in_groups_of(4)

SELECT  "waffles".* FROM "waffles" WHERE "waffles"."id" = $1 LIMIT $2  [["id", 980191003], ["LIMIT", 1]]
INSERT INTO "order_waffles" ("quantity", "waffle_id", "order_id") VALUES ($1, $2, $3) RETURNING "id"  [["quantity", 3], ["waffle_id", 980191003], ["order_id", 10]]
INSERT INTO "orders" ("price", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["price", 6.0], ["date", Fri, 12 May 2017], ["created_at", 2017-05-12 14:21:36 UTC], ["updated_at", 2017-05-12 14:21:36 UTC]]
UPDATE "orders" SET "price" = $1, "updated_at" = $2, "shop_id" = $3 WHERE "orders"."id" = $4  [["price", 12.0], ["updated_at", 2017-05-13 16:37:13 UTC], ["shop_id", 1], ["id", 23]]
---
  def create
    @order = Order.new
    @order.date = Time.now
    price = 0

    params[:selected_waffles].each { |id, quantity|
      if quantity[0].to_i == 0
        next
      end
      @order_waffle = OrderWaffle.new
      @order_waffle.order = @order
      @order_waffle.waffle = Waffle.find(id)
      @order_waffle.quantity = quantity[0]
      @order_waffle.save

SELECT "waffles".* FROM "waffles" WHERE (id IN (980191003,980191004))
---
  def edit
      @order = Order.new
    # @waffles = Waffle.all? { |  }
    @waffles = Waffle.where.not(discount:true).in_groups_of(4)

DELETE FROM "order_waffles" WHERE "order_waffles"."id" = $1  [["id", 28]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "order_waffles".* FROM "order_waffles" WHERE "order_waffles"."order_id" = $1  [["order_id", nil]]
SELECT  "waffles".* FROM "waffles" WHERE "waffles"."id" = $1 LIMIT $2  [["id", 980191003], ["LIMIT", 1]]
INSERT INTO "order_waffles" ("quantity", "waffle_id", "order_id") VALUES ($1, $2, $3) RETURNING "id"  [["quantity", 1], ["waffle_id", 980191003], ["order_id", 19]]
UPDATE "orders" SET "shop_id" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["shop_id", 1], ["updated_at", 2017-05-13 16:32:13 UTC], ["id", 16]]
---
  def update
    OrderWaffle.destroy_all(order_id: @order.id)
    price = 0
    params[:selected_waffles].each { |id, quantity|
      if quantity[0].to_i == 0
        next
      end
      @order_waffle = OrderWaffle.new
      @order_waffle.order = @order
      @order_waffle.waffle = Waffle.find(id)
      @order_waffle.quantity = quantity[0]
      @order_waffle.save