app/controllers/shops_controller.rb

INSERT INTO "shops" ("nazwa", "lokalizacja", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nazwa", "dfghd"], ["lokalizacja", "dgh"], ["created_at", 2017-05-13 15:45:20 UTC], ["updated_at", 2017-05-13 15:45:20 UTC]]
---
  def create
    @shop = Shop.new(shop_params)

    respond_to do |format|
      if @shop.save

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_shop
      @shop = Shop.find(params[:id])