app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "admin@gmail.pl"], ["created_at", 2017-05-13 18:52:11 UTC], ["updated_at", 2017-05-13 18:52:11 UTC], ["password_digest", "$2a$10$FP0yW7OYTIE/hpXWyRJNaeSZnqaieBu3RDAqLXlZ782A66lQdoVLe"]]