app/controllers/waffles_controller.rb

  def index
    # authorize! :read, Waffle
    @waffles = Waffle.where.not(discount:true)
---
SELECT "waffles".* FROM "waffles" WHERE ("waffles"."discount" != $1)  [["discount", true]]

  def create
    @waffle = Waffle.new(waffle_params)

    if @waffle.save
---
INSERT INTO "waffles" ("name", "price", "created_at", "updated_at", "image", "discount") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "rtyrty"], ["price", 7.0], ["created_at", 2017-05-11 17:11:55 UTC], ["updated_at", 2017-05-11 17:11:55 UTC], ["image", "gofr.jpg"], ["discount", true]]

  def update
    if @waffle.update(waffle_params)
---
UPDATE "waffles" SET "image" = $1, "updated_at" = $2 WHERE "waffles"."id" = $3  [["image", "gofr.jpg"], ["updated_at", 2017-05-11 15:45:38 UTC], ["id", 980191004]]

  def destroy
    Waffle.destroy(params[:id])
---
DELETE FROM "waffles" WHERE "waffles"."id" = $1  [["id", 980190991]]

  def removeImage
    @waffle.remove_image!
    @waffle.save
---
UPDATE "waffles" SET "image" = $1, "updated_at" = $2 WHERE "waffles"."id" = $3  [["image", nil], ["updated_at", 2017-05-11 15:45:27 UTC], ["id", 980191003]]

  def set_waffle
    @waffle = Waffle.find(params[:id])
---
SELECT  "waffles".* FROM "waffles" WHERE "waffles"."id" = $1 LIMIT $2  [["id", 980191004], ["LIMIT", 1]]